[{"url":"https://www.hdb.gov.sg/cs/infoweb/homepage","violations":[{"checklistitem":"Doctype","requirement":"The doctype is HTML5 and is at the top of all HTML pages.","priority":"High","testcase":"Pass","info":""},{"checklistitem":"Charset","requirement":"The charset declared (UTF-8) is declared correctly.","priority":"High","testcase":"Pass","info":""},{"checklistitem":"Viewport","requirement":"The viewport is declared correctly for responsive web design.","priority":"High","testcase":"Pass","info":""},{"checklistitem":"Title","requirement":"A title must be used on all pages.","priority":"High","testcase":"Pass","info":"Title has been declared as: Homepage - Housing & Development Board (HDB)"},{"checklistitem":"Description","requirement":"Ensure that meta description is provided. Meta description for each webpage is unique and accurately summarising the page content that both inform and interest the users if shown in search results.","priority":"High","testcase":"Pass","info":"Description of webpage is: Welcome to HDB InfoWEB. How can we help you?"},{"checklistitem":"Favicon","requirement":"Ensure to use HDB favicon and that it displays correctly. Do refer to the HDB Favicon guide and download the Favicon.","priority":"Medium","testcase":"Pass","info":""},{"checklistitem":"Alternate language","requirement":"The language tag of the website is specified and related to the language of the current page.","priority":"Low","testcase":"Pass","info":"Alternate language of webpage is: en"},{"checklistitem":"Common Head Script","requirement":"Ensure that head common script is added and placed correctly within the <head> section of the HTML page.","priority":"High","testcase":"Fail","info":"The common head script is not within the HTML document, or this page is not an e-Service webpage."},{"checklistitem":"Clean up comments","requirement":"Unnecessary code needs to be removed before sending the page to production.","priority":"Low","testcase":"Fail","info":"There are still comments within the code."},{"checklistitem":"URLs","requirement":"Use simple URLs that convey content information for web-based digital services.","priority":"High","testcase":"Pending","info":"Plese check if the following URL is acceptable. URL: https://www.hdb.gov.sg/cs/infoweb/homepage"},{"checklistitem":"Last updated date","requirement":"Display a last updated/reviewed date stamp at the end of webpages in web-based informational services to indicate the currency of the content.","priority":"High","testcase":"Pass","info":"Page was last updated on 19 May 2021, which is within the last 2 years."},{"checklistitem":"Webfont","requirement":"Ensure that HDB's 'Cabin' font is utilised.","priority":"High","testcase":"Pass","info":""},{"checklistitem":"Embedded or inline CSS","requirement":"Avoid embedding CSS in <style> tags or using inline CSS.","priority":"Medium","testcase":"Fail","info":"There is inline/embedded CSS present."},{"checklistitem":"Common Header Script","requirement":"Ensure that common header script is added and placed correctly within the start of the <body> section of the HTML page.","priority":"High","testcase":"Fail","info":"The common header script is not placed at the top of the <body> section, or this page is not an e-Service webpage."},{"checklistitem":"Common Footer Script","requirement":"Ensure that head common script is added and place correctly within the end of the <body> section of the HTML page.","priority":"High","testcase":"Fail","info":"The common footer script is not within the HTML document, or this page is not an e-Service webpage."},{"checklistitem":"JavaScript inline","requirement":"Ensure there is no JavaScript code inline, mixed with HTML code.","priority":"Medium","testcase":"Fail","info":""},{"checklistitem":"Alternative Text","requirement":"All <img> tags have an alternative text which describe the image visually.","priority":"High","testcase":"Fail","info":"There are images that do not have alternate texts."}]}]